cfd/p51/openfoam/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cv_x_min -20.0;
cv_x_max  60.0;
cv_y_min -15.0;
cv_y_max  15.0;
cv_z_min -15.0;
cv_z_max  15.0;

s2_x_min  -5.0;
s2_x_max  15.0;

convertToMeters 1.0;

vertices
(
    ( $cv_x_min       0.0 $cv_z_min )
    ( $s2_x_min       0.0 $cv_z_min )
    ( $s2_x_max       0.0 $cv_z_min )
    ( $cv_x_max       0.0 $cv_z_min )
    ( $cv_x_min $cv_y_max $cv_z_min )
    ( $s2_x_min $cv_y_max $cv_z_min )
    ( $s2_x_max $cv_y_max $cv_z_min )
    ( $cv_x_max $cv_y_max $cv_z_min )
    ( $cv_x_min       0.0       0.0 )
    ( $s2_x_min       0.0       0.0 )
    ( $s2_x_max       0.0       0.0 )
    ( $cv_x_max       0.0       0.0 )
    ( $cv_x_min $cv_y_max       0.0 )
    ( $s2_x_min $cv_y_max       0.0 )
    ( $s2_x_max $cv_y_max       0.0 )
    ( $cv_x_max $cv_y_max       0.0 )
    ( $cv_x_min       0.0 $cv_z_max )
    ( $s2_x_min       0.0 $cv_z_max )
    ( $s2_x_max       0.0 $cv_z_max )
    ( $cv_x_max       0.0 $cv_z_max )
    ( $cv_x_min $cv_y_max $cv_z_max )
    ( $s2_x_min $cv_y_max $cv_z_max )
    ( $s2_x_max $cv_y_max $cv_z_max )
    ( $cv_x_max $cv_y_max $cv_z_max )
);

blocks
(
    hex (  0  1  5  4  8  9 13 12 ) ( 15 15 15 ) simpleGrading ( 0.5 2.0 0.5 )
    hex (  8  9 13 12 16 17 21 20 ) ( 15 15 15 ) simpleGrading ( 0.5 2.0 2.0 )
    hex (  1  2  6  5  9 10 14 13 ) ( 30 15 15 ) simpleGrading ( 1.0 2.0 0.5 )
    hex (  9 10 14 13 17 18 22 21 ) ( 30 15 15 ) simpleGrading ( 1.0 2.0 2.0 )
    hex (  2  3  7  6 10 11 15 14 ) ( 45 15 15 ) simpleGrading ( 2.0 2.0 0.5 )
    hex ( 10 11 15 14 18 19 23 22 ) ( 45 15 15 ) simpleGrading ( 2.0 2.0 2.0 )
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (  0  8 12  4 )
            (  8 16 20 12 )
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (  3  7 15 11 )
            ( 11 15 23 19 )
        );
    }
    
    sym
    {
        type symmetryPlane;
        faces
        (
            // left
            (  0  1  9  8 )
            (  8  9 17 16 )
            (  1  2 10  9 )
            (  9 10 18 17 )
            (  2  3 11 10 )
            ( 10 11 19 18 )
        );
    }
    
    walls
    {
        type patch;
        faces
        (
            // right
            (  4 12 13  5 ) 
            ( 12 20 21 13 )
            (  5 13 14  6 )
            ( 13 21 22 14 )
            (  6 14 15  7 )
            ( 14 22 23 15 )
            
            // bottom
            (  0  4  5  1 ) 
            (  1  5  6  2 ) 
            (  2  6  7  3 )
            
            // top
            ( 16 17 21 20 )
            ( 17 18 22 21 )
            ( 18 19 23 22 )
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
